import { Bio } from '../app/type'

export const bios: readonly Bio[] = [
  {
    title: '新生代',
    content: [
      '🎓清华研二ing | 不被定义的INFJ',
      '💰搞钱 | 📚阅读 | 🌱终生成长',
      '✨分享学习心得与生活点滴',
    ].join('\n'),
  },
  {
    title: '新手妈妈',
    content: [
      '🩷学做自媒体的新手妈妈',
      '👶家有两岁9女宝👧🏻陪伴孩子，自我进步',
      '📝带娃日常/育儿经验/女性成长',
      '👀一起成长一起学习',
    ].join('\n'),
  },
  {
    title: '程序员',
    content: [
      '👨‍💻95后程序员 | 深圳生活',
      '🥰热爱编程，探索科技的魅力',
      '🌟分享技术干货与编程心得',
      '🚀一起学习，一起成长，期待交流！',
    ].join('\n'),
  },
  {
    title: '北漂族',
    content: [
      '👧🏻99年北漂女孩｜从0开始做自媒体',
      '💁‍♀️职场感悟｜自媒体写作｜副业搞钱',
      '☀️想给更多底层女孩带来能量',
      '📙不看私信，评论区见哦～',
    ].join('\n'),
  },
]

export enum Time {
  HOUR = 60 * 60,
  DAY = 60 * 60 * 24,
  WEEK = 60 * 60 * 24 * 7,
  MONTH = 60 * 60 * 24 * 30,
}
